const News = () => {
    return (
        <>
            <section className="news-section">
                <h1>Новини клубу Oldtimer</h1>

                <div className="news-item">
                    <div className="meeting-photos">
                        <img src="/photos/meetup-2024-1.jpeg" alt="Зустріч 2024" className="meeting-vertical-one"/>
                        <img src="/photos/meetup-2024-2.jpeg" alt="Зустріч 2024" className="meeting-vertical-two"/>
                        <img src="/photos/meetup-2024-3.jpeg" alt="Зустріч 2024" className="meeting-vertical-three"/>
                    </div>
                    <div className="car-description">Зустріч у Центральному міському парку – 22 вересня 2024</div>
                    <div className="car-text-container">
                        <p>Цьогорічна зустріч стала рекордною! У парку зібралося понад 25 ретро-автомобілів, які привернули увагу не лише ентузіастів, а й випадкових перехожих. Власники машин розповідали історії про свої улюблені авто, обговорювали процес реставрації та ділилися планами на майбутнє. Атмосфера була сповнена духом ностальгії, спогадів та захоплення автомобільною історією.</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <div className=""><h3>Зустріч у Центральному міському парку Вінниці ім. М. Леонтовича – 22 вересня 2024</h3></div>
                    <div className="car-text-container">
                        <p>Ми з нетерпінням чекаємо на цьогорічну зустріч, яка обіцяє бути наймасштабнішою в історії клубу Oldtimer! Планується приїзд понад 25 унікальних ретро-автомобілів, захоплива програма, тематичні фотозони та багато цікавинок для всіх відвідувачів. Приєднуйтесь до нас, щоб зануритися в атмосферу автомобільної класики!</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <div className="meeting-photos">
                        <img src="/photos/meetup-2023-1.jpeg" alt="Зустріч 2023" className="meeting-vertical-one"/>
                        <img src="/photos/meetup-2023-2.jpeg" alt="Зустріч 2023" className="meeting-vertical-two"/>
                        <img src="/photos/meetup-2023-3.jpeg" alt="Зустріч 2023" className="meeting-vertical-three"/>
                    </div>
                    <div className="car-description">Як пройшла зустріч у Центральному міському парку – 22 вересня 2023</div>
                    <div className="car-text-container">
                        <p>Ще один рік — ще більше автомобілів! Цього разу на зустріч з’їхалися 20 ретро-автомобілів, і кожен із них мав свою унікальну історію. Сонячна погода та затишний парк створили ідеальні умови для спілкування, фотосесій та обміну досвідом. Учасники та глядачі отримали море вражень, і багато хто вже почав готувати свої машини до наступної зустрічі.</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <div className=""><h3>Зустріч у Центральному міському парку Вінниці ім. М. Леонтовича – 22 вересня 2023</h3></div>
                    <div className="car-text-container">
                        <p>Клуб Oldtimer продовжує традицію щорічних зустрічей! Запрошуємо всіх поціновувачів ретро-авто долучитися до нас у Центральному міському парку, де ми знову зберемося, щоб поділитися своїми історіями, показати нові відновлені машини та просто насолодитися атмосферою старовинного автосвіту.</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <div className="meeting-photos">
                        <img src="/photos/meetup-2022-1.jpeg" alt="Зустріч 2022" className="meeting-vertical-one"/>
                        <img src="/photos/meetup-2022-2.jpeg" alt="Зустріч 2022" className="meeting-vertical-two"/>
                        <img src="/photos/meetup-2022-3.jpeg" alt="Зустріч 2022" className="meeting-vertical-three"/>
                    </div>
                    <div className="car-description">Як пройшла зустріч біля музею-садиби Пирогова – 22 вересня 2022</div>
                    <div className="car-text-container">
                        <p>Зустріч у мальовничому місці біля музею-садиби М. І. Пирогова зібрала 15 ретро-автомобілів. Чудова природа, історична атмосфера та тепла компанія створили неповторний настрій. Власники авто провели екскурсію своїми машинами, розповіли про їхні технічні особливості та складнощі реставрації.</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <div className=""><h3>Анонс: Зустріч біля Національного музею-садиби М. І. Пирогова – 22 вересня 2022</h3></div>
                    <div className="car-text-container">
                        <p>Настав час нової зустрічі! Цього року ми збираємося біля музею-садиби Пирогова, де нас чекає затишна атмосфера та гарна локація для фото. Очікуємо на цікаві автомобілі та ще більше знайомств!</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <img src="/photos/meetup-2021.jpeg" alt="Зустріч 2021" className="car-photo"/>
                    <div className="car-description">Як пройшла зустріч біля  музею "Володимир" – 22 вересня 2021</div>
                    <div className="car-text-container">
                        <p>Зустріч 2021 року була особливою – ми зібралися біля історичної будівлі  музею "Володимир". Атмосфера старого міста чудово гармоніювала з ретро-автомобілями, яких цього разу було 10. Автолюбителі обмінювалися враженнями, ділилися своїми планами щодо реставрації та насолоджувалися спільною поїздкою вулицями міста.</p>
                    </div>
                </div>
                
                <div className="news-item">
                    <div className=""><h3>Анонс: Зустріч біля  музею "Володимир" – 22 вересня 2021</h3></div>
                    <div className="car-text-container">
                        <p>Цьогорічна зустріч клубу Oldtimer пройде у знаковому місці – біля  музею "Володимир". Це чудова нагода об’єднати ретро-автомобілі з історичною спадщиною міста. Запрошуємо всіх охочих долучитися та поринути у світ автоностальгії!</p>
                    </div>
                </div>

                <div className="news-item">
                    <img src="/photos/meetup-2020.jpeg" alt="Зустріч 2020" className="car-photo"/>
                    <div className="car-description">22 вересня 2020 – Центральний автовокзал</div>
                    <div className="car-text-container">
                        <p>Перша масштабна зустріч клубу Oldtimer відбулася біля Центрального автовокзалу. Це була важлива подія – зібралося 5 автомобілів, і саме тут народилася традиція щорічних зустрічей. Учасники ділилися спогадами, знайомилися та планували майбутні заходи.</p>
                    </div>
                </div>

                <div className="news-item">
                    <div className=""><h3>Анонс: 22 вересня 2020 – Центральний автовокзал</h3></div>
                    <div className="car-text-container">
                        <p>Перша зустріч клубу Oldtimer! Запрошуємо всіх власників та шанувальників ретро-автомобілів на перший масштабний захід. Долучайтеся, щоб познайомитися, обговорити улюблені машини та закласти традицію щорічних зустрічей!</p>
                    </div>
                </div>
            </section>
        </>
    )
}
export default News;